# The Movie Database (TMDb)


In this SQL project, we conduct exploratory analyses on [The Movie Database](https://www.themoviedb.org/) – an online movie and TV show database that houses some of the most popular movies and TV shows at your fingertips. TMDb supports 39 official languages used in over 180 countries daily and dates all the way back to 2008. 


<img src="https://github.com/Explore-AI/Pictures/blob/master/sql_tmdb.jpg?raw=true" width=80%/>


Below is an Entity Relationship Diagram (ERD) of the database:

<img src="https://github.com/Explore-AI/Pictures/blob/master/TMDB_ER_diagram.png?raw=true" width=70%/>

As can be seen from the ERD, the database consists of `12 tables` containing information about movies, cast, genre, and so much more.  

Let's get started!

## Loading the database

Before we begin, we need to prepare the SQL environment.

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter Notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

Next, let's go ahead and load the database. To do this, we need to ensure that we have downloaded the `TMDB.db` SQLite file and have stored it in the same directory as this notebook.

In [7]:
# Establish a connection to the local database using the '%sql' magic command.

%sql sqlite:///TMDB.db

MetaData.__init__() got an unexpected keyword argument 'bind'
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

If the above line didn't throw out any errors, then we should be good to go!

### 2015 “Actor in a Leading Role” Winner

We find who won the Oscar for “Actor in a Leading Role” in  2015. Having looked at the database, we see that the winner is indicated as '1.0'. Therefore, we proceed to execute the following query.

In [3]:
%%sql

SELECT
    *
FROM
    oscars
WHERE
    award = 'Actor in a Leading Role'
    AND year = '2015'
    AND winner = '1.0';

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

### The ten oldest movies in the database

To get insight into the earlier years/entries of the database, we run a query to produce the ten oldest movies.

In [98]:
%%sql

SELECT
    *
FROM
    movies
WHERE
    release_date IS NOT NULL
ORDER BY
    release_date ASC
LIMIT 10;

 * sqlite:///TMDB.db
Done.

[(3059, 'Intolerance', '1916-09-04 00:00:00.000000', 385907, None, 'en', 'Intolerance', 'The story of a poor young woman, separated by prejudice from her husband and baby, is interwoven with tales of intolerance from throughout history.', 3.232447, 8394751.0, 197.0, 'Released', 'The Cruel Hand of Intolerance', 7.4, 60),
 (3060, 'The Big Parade', '1925-11-05 00:00:00.000000', 245000, None, 'en', 'The Big Parade', "The story of an idle rich boy who joins the US Army's Rainbow Division and is sent to France to fight in World War I, becomes friends with two working class men, experiences the horrors of trench warfare, and finds love with a French girl.", 0.785744, 22000000.0, 151.0, 'Released', None, 7.0, 21),
 (19, 'Metropolis', '1927-01-10 00:00:00.000000', 92620000, None, 'de', 'Metropolis', "In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a working class prophet who predicts the coming of a savior to mediate their differences.", 32.351527, 650422.0, 153.0, 'Released', 'There can be no understanding between the hands and the brain unless the heart acts as mediator.', 8.0, 657),
 (905, "Pandora's Box", '1929-01-30 00:00:00.000000', 0, None, 'de', 'Die Bnchse der Pandora', 'The rise and inevitable fall of an amoral but naive young woman whose insouciant eroticism inspires lust and violence in those around her.', 1.824184, 0.0, 109.0, 'Released', None, 7.6, 45),
 (65203, 'The Broadway Melody', '1929-02-08 00:00:00.000000', 379000, None, 'en', 'The Broadway Melody', "Harriet and Queenie Mahoney, a vaudeville act, come to Broadway, where their friend Eddie Kerns needs them for his number in one of Francis Zanfield' ... (195 characters truncated) ... eenie recognizes, that she is for Jock nothing more than a toy, and it also takes a while till Harriet recognizes, that Eddie is in love with Queenie", 0.968865, 4358000.0, 100.0, 'Released', "The pulsating drama of Broadway's bared heart speaks and sings with a voice to stir your soul!", 5.0, 19),
 (22301, "Hell's Angels", '1930-11-15 00:00:00.000000', 3950000, None, 'en', "Hell's Angels", "Two brothers attending Oxford enlist with the Royal Flying Corps when World War I breaks out. Roy and Monte Rutledge have very different personalitie ... (576 characters truncated) ... t a strategic German munitions facility is a booming success, but with a squadron of fighters bearing down on them afterwards, escape seems unlikely.", 8.484123, 8000000.0, 127.0, 'Released', "Howard Hughes' Thrilling Multi-Million Dollar Air Spectacle", 6.1, 19),
 (22649, 'A Farewell to Arms', '1932-12-08 00:00:00.000000', 4, None, 'en', 'A Farewell to Arms', "British nurse Catherine Barkley (Helen Hayes) and American Lieutenant Frederic Henry (Gary Cooper) fall in love during the First World War in Italy.  ... (105 characters truncated) ... the war rages on. Academy Awards winner for Best Cinematography and for Best Sound, Recording. Nominated for Best Picture and for Best Art Direction.", 1.199451, 25.0, 89.0, 'Released', 'Every woman who has loved will understand', 6.2, 28),
 (3062, '42nd Street', '1933-02-02 00:00:00.000000', 439000, None, 'en', '42nd Street', 'A producer puts on what may be his last Broadway show, and at the last moment a chorus girl has to replace the star.', 1.933366, 2281000.0, 89.0, 'Released', None, 6.1, 37),
 (43595, 'She Done Him Wrong', '1933-02-09 00:00:00.000000', 200000, None, 'en', 'She Done Him Wrong', '"New York singer and nightclub owner Lady Lou has more men friends than you can imagine. Unfortunately one of them is a vicious criminal who\'s escap ... (52 characters truncated) ... ing she hasn\'t exactly been faithful in his absence. Help is at hand in the form of young Captain Cummings a local temperance league leader though."', 0.622752, 2200000.0, 66.0, 'Released', "Mae West gives a 'Hot Time' to the nation!", 5.1, 27),
 (3078, 'It Happened One Night', '1934-02-22 00:00:00.000000', 325000, None, 'en', 'It Happened One Night', "Ellie Andrews has just tied the knot with society aviator King Westley when she is whisked away to her father's yacht and out of King's clutches. Ell ... (233 characters truncated) ... ts her back to her husband, or he'll blow the whistle on Ellie to her father. Either way, Peter gets what he wants... a really juicy newspaper story!", 11.871424, 4500000.0, 105.0, 'Released', 'TOGETHER... for the first time', 7.7, 275)]

### Unique Awards

Futhermore, we explore how many unique awards there are in the Oscars table.

In [99]:
%%sql

SELECT
    COUNT( DISTINCT award ) AS num_awards
FROM
    oscars;

 * sqlite:///TMDB.db
Done.

[(114,)]

### Movies with the word 'Spider'

A firm favourite of mine is the 'Spider-Man' movies, and here we explore ow many movies there are that contain the word “Spider” within their title.

In [100]:
%%sql

SELECT
    COUNT( title ) AS num_movies
FROM
    movies
WHERE
    title LIKE '%Spider%';

 * sqlite:///TMDB.db
Done.

[(9,)]

### Thriller movies with romance

Thrillers are also a firm favourite of mine, and I think it would be interesting to see how many of those there are that are also based on love or a similar theme in their plot (i.e. movies both in the "Thriller" genre and containing the word “love” anywhere in the keywords).

In [103]:
%%sql

SELECT
    m.title,
    g.genre_name,
    k.keyword_name,
    m.movie_id AS movie_id,
    gm.movie_id AS genre_movie_id,
    km.movie_id AS keyword_movie_id,
    COUNT( DISTINCT m.title ) AS num_movies
FROM
    movies m
JOIN
    genremap gm
ON
    m.movie_id = gm.movie_id
JOIN
    genres g
ON
    gm.genre_id = g.genre_id
JOIN
    keywordmap km
ON
    m.movie_id = km.movie_id
JOIN
    keywords k
ON
    km.keyword_id = k.keyword_id
WHERE
    g.genre_name = 'Thriller'
    AND k.keyword_name LIKE '%love%';

 * sqlite:///TMDB.db
Done.

[('The Fifth Element', 'Thriller', 'love', 18, 18, 18, 48)]

### Movies with a popularity score more than 40 and budget less than 50 000 000

As we continue our exploration, we are interested in how many movies there are that were released between 1 August 2006 ('2006-08-01') and 1 October 2009 ('2009-10-01') that have a popularity score of more than 40 and a budget of less than 50 000 000.

In [102]:
%%sql

SELECT
    title,
    popularity,
    release_date,
    budget,
    COUNT( title ) AS num_movies
FROM
    movies
WHERE
    release_date BETWEEN '2006-08-01' AND '2009-10-01'
    AND popularity > 40
    AND budget < 50000000;

 * sqlite:///TMDB.db
Done.

[('The Prestige', 74.440708, '2006-10-19 00:00:00.000000', 40000000, 29)]

### Characters played by 'Vin Diesel'

Having embodied a number of characters in his career, 'Vin Diesel' is one of the most celebrated actors in Hollywood. In this query we see how many unique characters he has played so far in this database.

In [ ]:
%%sql

SELECT
    a.actor_name,
    c.characters,
    COUNT( DISTINCT c.characters ) AS num_characters
FROM
    actors a
JOIN
    casts c
ON
    a.actor_id = c.actor_id
WHERE 
    a.actor_name LIKE '%Vin Diesel%';

 * sqlite:///TMDB.db
Done.

[('Vin Diesel', 'Finger (voice)', 16)]

### The Royal Tenenbaums

This classic comedy is a hit with many people, but is that the only theme that the movie carries? We explore what the genres of the movie “The Royal Tenenbaums” are.

In [ ]:
%%sql

SELECT
    m.title,
    g.genre_name,
    m.movie_id AS movie_id,
    gm.movie_id AS genre_movie_id
FROM
    movies m
JOIN
    genremap gm
ON
    m.movie_id = gm.movie_id
JOIN
    genres g
ON
    gm.genre_id = g.genre_id
WHERE
    m.title LIKE '%The Royal Tenenbaums%';

 * sqlite:///TMDB.db
Done.

[('The Royal Tenenbaums', 'Drama', 9428, 9428),
 ('The Royal Tenenbaums', 'Comedy', 9428, 9428)]

### Production companies with average movie popularity

It's one thing to know what movies we like, but how about we see that the brains behind these firm favourites? Here we look into what are the three production companies that have the highest movie popularity score on average, as recorded within the database.

In [90]:
%%sql

SELECT
    p.production_company_name,
    SUM( m.popularity ) AS total_popularity,
    COUNT( p.production_company_name ) AS num_company,
    AVG(m.popularity) AS avg_popularity
FROM
    movies m
JOIN
    productioncompanymap pm
ON
    m.movie_id = pm.movie_id
JOIN
    productioncompanies p
ON
    pm.production_company_id = p.production_company_id
GROUP BY
    p.production_company_name
ORDER BY avg_popularity DESC
LIMIT 5;

 * sqlite:///TMDB.db
Done.

[("The Donners' Company", 514.569956, 1, 514.569956),
 ('Bulletproof Cupid', 481.098624, 1, 481.098624),
 ('Kinberg Genre', 653.8419980000001, 2, 326.92099900000005),
 ('Illumination Entertainment', 1174.600212, 5, 234.9200424),
 ('Vita-Ray Dutch Productions (III)', 198.372395, 1, 198.372395)]

### Actresses that have a name starting with 'N'

How many female actors (i.e. where gender = 1) are there have a name that starts with the letter "N"?

In [ ]:
%%sql

SELECT
    gender,
    COUNT(actor_name) AS num_actors
FROM
    actors
WHERE
    gender = 1
    AND actor_name LIKE 'N%';

 * sqlite:///TMDB.db
Done.

[('Nancy Cartwright', 1, 355)]

### Genre with lowest average popularity score

Let's explore which genre has, on average, the lowest movie popularity score.

In [ ]:
%%sql

SELECT
    g.genre_name,
    SUM( m.popularity ) AS total_popularity,
    COUNT( g.genre_name ) AS num_genre,
    AVG(m.popularity) AS avg_popularity
FROM
    movies m
JOIN
    genremap gm
ON
    m.movie_id = gm.movie_id
JOIN
    genres g
ON
    gm.genre_id = g.genre_id
WHERE
    g.genre_name IN ( 'Science Fiction', 'Animation', 'Documentary', 'Foreign' )
GROUP BY
    g.genre_name
ORDER BY avg_popularity ASC;

 * sqlite:///TMDB.db
Done.

[('Foreign', 23.350751, 34, 0.686786794117647),
 ('Documentary', 434.029619, 110, 3.9457238090909095),
 ('Science Fiction', 19501.716141, 535, 36.451805871028036),
 ('Animation', 9082.344799, 234, 38.813439311965816)]

### Award category with high actor nominations

Which award category has the highest number of actor nominations (actors can be male or female)? (Hint: `Oscars.name` contains both actors' names and film names.)

In [ ]:
%%sql

SELECT
    award,
    COUNT( DISTINCT name ) AS num_actors
FROM
    oscars
WHERE 
    award IN ('Special Achievement Award', 'Actor in a Supporting Role', 'Actress in a Supporting Role', 'Best Picture')
GROUP BY
    award
ORDER BY num_actors DESC
LIMIT 10;

 * sqlite:///TMDB.db
Done.

[('Actor in a Supporting Role', 309),
 ('Actress in a Supporting Role', 306),
 ('Best Picture', 298),
 ('Special Achievement Award', 3)]

### Update year column

For all of the entries in the Oscars table before 1934, the year is stored differently than in all the subsequent years. For example, the year would be saved as “1932/1933” instead of just “1933” (the second indicated year).  We use the following query to update this column to have the format of the year be consistent throughout the entire table (with only the second indicated year shown).

In [ ]:
%%sql

SELECT
    year,
    substr( year, -4 ) AS year_new
FROM
    oscars
LIMIT 10;

#UPDATE Oscars SET year = substr( year, -4 )

 * sqlite:///TMDB.db
Done.

[('1928', '1928'),
 ('1928', '1928'),
 ('1928', '1928'),
 ('1928', '1928'),
 ('1928', '1928'),
 ('1928', '1928'),
 ('1928', '1928'),
 ('1928', '1928'),
 ('1928', '1928'),
 ('1928', '1928')]

### 'Alan Rickman' view

If we imagine that DStv will be having a special week dedicated to the actor 'Alan Rickman'. We can the following query to create a new _view_ that shows the titles, release dates, taglines, and overviews of all movies that Alan Rickman has played in.

In [ ]:
%%sql

CREATE VIEW Alan_Rickman_Movies AS  
    SELECT
        title,
        release_date,
        tagline,
        overview
    FROM
        movies  
    LEFT JOIN
        casts ON casts.movie_id = movies.movie_id
    LEFT JOIN
        actors ON casts.actor_id = actors.actor_id
    WHERE 
        actors.actor_name = 'Alan Rickman';

 * sqlite:///TMDB.db
(sqlite3.OperationalError) view Alan_Rickman_Movies already exists
[SQL: CREATE VIEW Alan_Rickman_Movies AS
    SELECT
        title,
        release_date,
        tagline,
        overview
    FROM
        movies
    LEFT JOIN
        casts ON casts.movie_id = movies.movie_id
    Left JOIN
        actors ON casts.actor_id = actors.actor_id
    WHERE
        actors.actor_name = 'Alan Rickman';]
(Background on this error at: https://sqlalche.me/e/14/e3q8)